/**
 * JavaScript 5일차 과제
 * 주사위 만들기 2
 *
 * 출력 확인법
 * Terminal 창에 다음 코드를 작성해주세요.
 * node main
 *
 * 랜덤 주사위 숫자 diceNumber를 만드는 rollingDice 함수를 만들어주세요.
 * 주사위 숫자는 함수를 호출할 때마다 랜덤한 숫자로 바뀌어야합니다.
 * rollingDice 함수 안에 diceArt를 넣어주세요.
 *
 * 예시
 * 주사위 숫자 = 1;
 * 
 * 출력   
  ┌─────┐
  │     │
  │  ●  │
  │     │
  └─────┘
 */

// 여기에 코드를 작성해주세요.

// rollingDice 함수

// diceArt를 rollingDice 함수 안에 넣어주세요.

// const diceArt = [
//   '0인 경우는 제외해주세요.',
//   `
//   ┌─────┐
//   │     │
//   │  ●  │
//   │     │
//   └─────┘
//   `,
//   `
//   ┌─────┐
//   │ ●   │
//   │     │
//   │   ● │
//   └─────┘
//   `,
//   `
//   ┌─────┐
//   │ ●   │
//   │  ●  │
//   │   ● │
//   └─────┘
//   `,
//   `
//   ┌─────┐
//   │ ● ● │
//   │     │
//   │ ● ● │
//   └─────┘
//   `,
//   `
//   ┌─────┐
//   │ ● ● │
//   │  ●  │
//   │ ● ● │
//   └─────┘
//   `,
//   `
//   ┌─────┐
//   │ ● ● │
//   │ ● ● │
//   │ ● ● │
//   └─────┘
//   `,
// ];

function rollingDice() {
    const num = Math.floor(Math.random() * 6 + 1);
  
    const diceArt = [
      '0인 경우는 제외해주세요.',
      `
      ┌─────┐
      │     │
      │  ●  │
      │     │
      └─────┘
      `,
      `
      ┌─────┐
      │ ●   │
      │     │
      │   ● │
      └─────┘
      `,
      `
      ┌─────┐
      │ ●   │
      │  ●  │
      │   ● │
      └─────┘
      `,
      `
      ┌─────┐
      │ ● ● │
      │     │
      │ ● ● │
      └─────┘
      `,
      `
      ┌─────┐
      │ ● ● │
      │  ●  │
      │ ● ● │
      └─────┘
      `,
      `
      ┌─────┐
      │ ● ● │
      │ ● ● │
      │ ● ● │
      └─────┘
      `,
    ];
  
    return diceArt[num];
  }
  
  console.log(rollingDice());
  